<?php

namespace Database\Seeders;

use App\Models\Card;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CardSeeder extends Seeder
{
    public function run(): void
    {
        Card::create([
            "card" => "world",
            "card_name" => "Світ",
            "img_name" => "Старші аркани/Світ.jpg",
            "main_meaning_dir" => "Завершення, гармонія, відповідність, успіх, виконання мрій, повнота, вирішення",
            "main_meaning_rev" => "Недовершеність, незгодність, невирішені питання, невдале завершення, незадоволеність",
            "meaning_dir" => "Карта Таро Світ символізує повноту, гармонію та завершення. На зображенні вона зображена як танцююча жінка, оточена символами чотирьох елементів: вогню, води, повітря і землі. Ця карта вказує на успіх, виконання мрій і досягнення гармонії у різних аспектах життя.

            Світ також олицює відповідність і вирішення. Вона надихає нас завершити те, що ми розпочали і досягти повноти і завершення. Карта вказує на позитивні зміни, успіх і виконання цілей.

            У контексті відносин Світ може означати гармонійну і повноту взаєморозуміння, довершення відносин і спільне досягнення цілей.

            В сфері роботи і кар'єри Світ символізує успіх, виконання проектів і завершення бізнес-завдань.

            У сфері особистого розвитку Світ означає самореалізацію, досягнення балансу і гармонії, розширення свідомості і розвиток внутрішнього потенціалу.",
            "meaning_rev" => "У зворотньому положенні, Світ може вказувати на недовершеність, незгодність або невирішені питання. Це може свідчити про невдале завершення проекту або незадоволеність з результатами. Також можуть виникати конфлікти і розбіжності, що заважають досягненню гармонії і успіху.

            Карта Світ у зворотньому положенні може також вказувати на незавершені аспекти життя, нереалізовані мрії і відсутність повноти. Це може спричинити почуття незадоволеності та потребу у вирішенні невирішених питань.

            У відносинах зворотна Світ може вказувати на незгоду, конфлікти і незбалансованість. Взаєморозуміння і гармонія можуть бути порушені, що вимагає розв'язання проблем і відновлення балансу.

            В роботі і кар'єрі зворотна Світ може вказувати на невдалий проект, незавершену роботу або невирішені проблеми. Треба зосередитися на вирішенні незавершених справ і відновленні гармонії в професійній діяльності.

            У сфері особистого розвитку зворотна Світ може вказувати на потребу у внутрішньому балансі, саморефлексії і розвитку. Необхідно звернути увагу на незадоволеність і невирішені питання, щоб досягти повноцінного особистісного зростання.",
            "describe" => "Світ є останньою карткою Таро в шляху Старших арканів. Вона символізує повноту, гармонію, успіх і завершення. Карта вказує на досягнення цілей, вирішення незавершених питань і виконання мрій. Світ олицює позитивні зміни, гармонію в різних аспектах життя і повноту взаєморозуміння.",
        ]);
    }
}

/*
    $img_name = "Старші аркани/Верховна Жриця.jpg";
    $card_name = "Верховна Жриця";
    $main_meaning_dir = "Таємничість, чуттєвість, бажаність, недосяжність, родючість, творчість, підсвідомість, жага до знань, висока сила, інтуїція, внутрішній голос, божественне жіноче начало";
    $main_meaning_rev = "Заблоковані екстрасенсорні здібності, проблеми з родючістю, неконтрольовані спалахи, пригнічена інтуїція, сексуальна напруженість, небажана увага, розгубленість, приховані мотиви, поверховість, мовчання";
    $describe = "Верховна жриця сидить перед тонкою пурдою, прикрашеною гранатами. Ця пурда ілюструє різні підсвідомі і свідомі сфери, невидиме і видиме, і допомагає тримати на відстані випадкових глядачів. Лише посвячені можуть увійти туди. Гранати на пурді уособлюють божественне жіноче начало, достаток і родючість. Він є священним для Персефони. Вона з’їла зернятко граната в підземному царстві і була змушена приходити щороку.
    По обидва боки від верховної жриці стоять два великих стовпи. Вони позначають вхід до цього містичного місця. Один стовп чорний, на ньому викарбувано літеру Б, що означає “Боаз”, тобто “сильний”, “могутній”. Інший – білий, на ньому викарбувано літеру Я, що означає “Яхін”, тобто “Він встановить”. Чорно-білі відтінки стовпів символізують дуалізм, як чоловіче і жіноче, темряву і світло, щоб пояснити світові, що прийняття і знання дуальної природи всього є обов’язковим для виживання в цьому світі.
    Крім того, з Таро Верховної Жриці ви побачите, що вона одягнена в блакитну мантію, з хрестом на грудях і рогатою короною на голові. Обидва ці аксесуари уособлюють її божественну мудрість і статус правительки. В руці вона тримає сувій, який частково зображений, що означає, що святе знання є одночасно прихованим і явним і відкриється людині, якщо вона буде готова копнути глибше і вийти за межі матеріалізму. Півмісяць біля її ніг символізує її зв’язок з божественним фемінізмом, підсвідомістю та інтуїцією.";
    $meaning_dir = "Карта таро “Верховна жриця” під час читання таро уособлює таємницю, чуттєвість та інтуїцію. Випадання цієї карти означає, що ви повинні довіряти своїм інстинктам і рухатися тим шляхом, який ви вважаєте найкращим для себе, не слухаючи і не довіряючи тому, що говорять інші. Шукайте свої цілі та мрії, а також всі символи та знаки, які посилає вам Всесвіт. Більше того, ця карта Таро, що стоїть вертикально, також означає, що ви, безсумнівно, володієте хорошими знаннями про речі, які вас оточують. Таким чином, розбудіть в собі божественне жіноче начало і шукайте відповіді на незвідане.
    Верховна Жриця (у вертикальному положенні) уособлює інтуїтивність і духовність. Тому, якщо вам випала ця карта під час ворожіння на Таро, шукайте можливості, що стосуються духовної роботи та молитов. Крім того, Верховна Жриця більше схожа на правлячу даму. Це уособлює силу і владу для виконання всіх завдань в її житті. Отже, вам не повинно бракувати мужності виконувати завдання і прислухатися до свого серця, щоб шукати відповіді на свої сумніви і питання. Крім того, ви повинні захистити себе від будь-якого негативу і глибше шукати своє внутрішнє “я”, щоб зрозуміти свої навички та здібності, які допоможуть вам досягти успіху в житті.";
    $meaning_rev = "Перевернута карта Верховна Жриця ілюструє, що ви, безумовно, спрямуєте себе на своє внутрішнє “я” та його вібрації та енергії. Ви були б сповнені мудрості. Однак, з іншого боку, ви станете жертвою мінливого розуму і хитких думок. Ви будете більше занурені у власну драму та ігноруватимете свої цілі та бажання. Це перевертання карти також вказує на те, що ви можете тримати себе подалі від зовнішнього світу і уникати ділитися своїм справжнім “я” з оточуючими. У вас буде більше сумнівів у собі, ніж позитиву. Заперечень буде більше, ніж прийняття. Крім того, існує ймовірність того, що ви можете ігнорувати свої внутрішні можливості через те ж саме.
    Ця карта вказує на загальну капітуляцію. Речі навколо вас можуть звести вас з розуму і ви втратите терпіння. Ваше мислення буде бачити більше негативних сторін, ніж позитивних. Більше того, ви також станете людиною пліток. У вас також з’являться люди з прихованими намірами. З іншого боку, ви будете чудовим комунікатором. Якщо ви використовуєте це з розумом, ви будете великим. Крім того, ви можете вірити в неправду, для чого вам слід частіше вести чесні та відкриті розмови з оточуючими вас людьми. Крім того, тримайте секрети на відстані.";
*/