<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class TarotDiviationController extends Controller
{
    public function show(){
        $tarotCards = [
            '/Старші аркани/Дурень.jpg',
            '/Старші аркани/Чаклун.jpg',
            '/Старші аркани/Верховна жриця.jpg',
            '/Старші аркани/Імператриця.jpg',
            '/Старші аркани/Імператор.jpg',
            '/Старші аркани/Ієрофант.jpg',
            '/Старші аркани/Закоханні.jpg',
            '/Старші аркани/Колісниця.jpg',
            '/Старші аркани/Сила.jpg',
            '/Старші аркани/Відлюдник.jpg',
            '/Старші аркани/Колесо Фортуни.jpg',
            '/Старші аркани/Справедливість.jpg',
            '/Старші аркани/Повішаний.jpg',
            '/Старші аркани/Смерть.jpg',
            '/Старші аркани/Помірність.jpg',
            '/Старші аркани/Диявол.jpg',
            '/Старші аркани/Вежа.jpg',
            '/Старші аркани/Зірка.jpg',
            '/Старші аркани/Місяць.jpg',
            '/Старші аркани/Сонце.jpg',
            '/Старші аркани/Суд.jpg',
            '/Старші аркани/Світ.jpg',
            "/Молодші аркани/Жезли/2 жезлів.jpg",
            "/Молодші аркани/Жезли/Трійка Жезлів.jpg",
            "/Молодші аркани/Жезли/Четвірка Жезлів.jpg",
            "/Молодші аркани/Жезли/П'ятірка Жезлів.jpg",
            "/Молодші аркани/Жезли/Шестірка жезлів.jpg",
            "/Молодші аркани/Жезли/Семірка жезлів.jpg",
            "/Молодші аркани/Жезли/Вісімка Жезлів.jpg",
            "/Молодші аркани/Жезли/Дев'ятка Жезлів.jpg",
            "/Молодші аркани/Жезли/Десятка Жезлів.jpg",
            "/Молодші аркани/Жезли/Лицар Жезлів.jpg",
            "/Молодші аркани/Жезли/Король Жезлів.jpg",
            "/Молодші аркани/Жезли/Королева Жезлів.jpg",
            "/Молодші аркани/Жезли/Паж Жезлів.jpg",
            "/Молодші аркани/Жезли/Туз жезлів.jpg",
            "/Молодші аркани/Кубки/Двійка Кубків.jpg" ,
            "/Молодші аркани/Кубки/Трійка Кубків.jpg" ,
            "/Молодші аркани/Кубки/Четвірка Кубків.jpg",
            "/Молодші аркани/Кубки/П’ятікра Кубків.jpg",
            "/Молодші аркани/Кубки/Шістка Кубків.jpg" ,
            "/Молодші аркани/Кубки/Сімка Кубків.jpg" ,
            "/Молодші аркани/Кубки/Вісімка Кубків.jpg" ,
            "/Молодші аркани/Кубки/Дев’ятка Кубків.jpg",
            "/Молодші аркани/Кубки/Десятка Кубків.jpg" ,
            "/Молодші аркани/Кубки/Король Кубків.jpg" ,
            "/Молодші аркани/Кубки/Королева Кубків.jpg",
            "/Молодші аркани/Кубки/Лицар Кубків.jpg" ,
            "/Молодші аркани/Кубки/Паж Кубків.jpg" ,
            "/Молодші аркани/Мечі/Туз мечів.jpg" ,
            "/Молодші аркани/Мечі/2 мечів.jpg",
            "/Молодші аркани/Мечі/3 мечів.jpg" ,
            "/Молодші аркани/Мечі/4 мечів.jpg" ,
            "/Молодші аркани/Мечі/5 мечів.jpg" ,
            "/Молодші аркани/Мечі/6 мечів.jpg" ,
            "/Молодші аркани/Мечі/7 мечів.jpg" ,
            "/Молодші аркани/Мечі/8 мечів.jpg" ,
            "/Молодші аркани/Мечі/9 мечів.jpg" ,
            "/Молодші аркани/Мечі/10 мечів.jpg",
            "/Молодші аркани/Мечі/Король мечів.jpg" ,
            "/Молодші аркани/Мечі/Королева мечів.jpg",
            "/Молодші аркани/Мечі/Лицар мечів.jpg" ,
            "/Молодші аркани/Мечі/Паж мечів.jpg" ,
            "/Молодші аркани/Пентаклі/Туз пентаклів.jpg",
            "/Молодші аркани/Пентаклі/2 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/3 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/4 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/5 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/6 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/7 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/8 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/9 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/10 пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/Король пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/Королева пентаклів.jpg",
            "/Молодші аркани/Пентаклі/Лицар пентаклів.jpg" ,
            "/Молодші аркани/Пентаклі/Паж пентаклів.jpg" 
        ];
        
        // Перемішування карт
        shuffle($tarotCards);
        
        // Вибір перших 7 карт
        $cards = array_slice($tarotCards, 0, 7);
        $selectedCards = array();

        foreach($cards as $card) {
            $selectedCards[] = ['image' => $card, 'reversed' => rand(0,1)];
        }

        return view('diviation-page', compact("selectedCards"));
    }

    public function getAnswer(Request $request)
    {
        // Отримання даних з POST-запиту
        $selectedCards = $request->input('selected_cards');
        
        // Логіка обробки вибраних карт і отримання відповіді
        
        // Повернення відповіді у форматі JSON
        return response()->json(['answer' => 'Ваша відповідь']);
    }
}
